In [238]:
import pandas as pd

In [239]:

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [240]:
# Q1: Disply Top 3 Rows of dataset. 
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [241]:
# Q2: check last 3 rows of dataset.
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [242]:
# finds shapes of our dataset (number rows and columns)
df1.shape

(7, 3)

In [243]:
# get informtions about our dataset like total number rows, total number of columns , 
# datatypes of eath columns and memory requirement
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [244]:
## check null values in the dataset
df1.isna().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [245]:
## get overall statistics about the dataframe.
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [246]:
## find unique values from the gender column 
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [247]:
## find the number of unique value from the gender column

df1['Gender'].nunique()

2

In [248]:
## display count of unique values from gender columns.
df1["Gender"].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [249]:
## find total number of students having marks between 90 to 100 (inclusive) using between method .
df1[df1["Marks"]>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [250]:
df1[(df1["Marks"]>=90) & (df1["Marks"]<=100) ]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [251]:
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [252]:
len(df1[(df1["Marks"]>=90) & (df1["Marks"]<=100) ])

4

In [253]:
## find average marks 
df1["Marks"].mean()

92.14285714285714

In [254]:
## apply method
def marks(x):
    return x/2

In [255]:
df1["Marks"].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [256]:
df1["half_Marks"]=df1["Marks"].apply(marks)

In [257]:
df1

      Name  Marks  Gender  half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [258]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [259]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [260]:
## map function
df1['Female_Male']=df1['Gender'].map({'Male':1 ,'Female':0})
df1

      Name  Marks  Gender  half_Marks  Female_Male
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [261]:
## drops column(s)

In [262]:
df1

      Name  Marks  Gender  half_Marks  Female_Male
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [263]:
df1.drop(columns=["half_Marks","Female_Male"])

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [264]:
## print name of columns 
df1.columns

Index(['Name', 'Marks', 'Gender', 'half_Marks', 'Female_Male'], dtype='object')

In [265]:
## sort dataframe as per the marks column
df1

      Name  Marks  Gender  half_Marks  Female_Male
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [266]:
df1.sort_values(by="Marks")

      Name  Marks  Gender  half_Marks  Female_Male
5   Mittal     83  Female        41.5            0
3   Vedant     87    Male        43.5            1
1   Aadhya     89  Female        44.5            0
4   Parshv     90    Male        45.0            1
0  Priyang     98    Male        49.0            1
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0

In [267]:
## display name and marks of females students 

#df1=df1[df1["Gender"]=="Female"]
#df1[['Gender','Name','Marks']]

In [268]:
df1[df1["Gender"]=="Female"][["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [271]:
df1[df1['Gender'].isin(["Female"])][["Name","Marks","Gender"]]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female